 

package hw.案例.优先队列;

/**
 * desc:
 *
 * @author junlin
 * @since 2022/1/13
 **/
public class 除湿器 {
    /*
    梅雨季节，园区有 n 个房间需要除湿，数组 humidity 中存储了每个房间的湿度值（0 表示不需除湿）。
    园区配备了两种除湿机 各 1 台，第一种为小型除湿机，每分钟能将 1 个房间的湿度值减少 single，第二种为中央除湿机，每分钟可将 n-1 个房间湿度值减少
    multiple。每个房间同一时间仅能使用一种除湿机，每分钟可以按需选择更换或不更换除湿机。若湿度降至 0 后数值不会继续变化。
    请返回最短需要几分钟将全部房间的湿度值都降到 0。
    示例 1：
    输入：humidity = [3,2,3], single = 2, multiple = 3
    输出：1
    解释：仅需 1 分钟即可完成除湿工作。其中小型除湿机处理下标为 1 （湿度值为 2）的房间，中央除湿机处理剩余房间。

    限制：
    1 <= humidity.length <= 10^5
    0 <= humidity[i] <= 10^6
    1 <= single,multiple <= 1000
     */

}
